server/templates/v_10/suministroFacturasRecibidas/suministroLRFacturasRecibidas.hbs

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sum="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroLR.xsd"
 xmlns:sum1="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroInformacion.xsd">
	<soapenv:Header/>
	<soapenv:Body>
		<sum:SuministroLRFacturasRecibidas>
			<sum1:Cabecera>
				<sum1:IDVersionSii>{{ cabecera.idVersion }}</sum1:IDVersionSii>
				<sum1:Titular>
					<sum1:NombreRazon>{{ cabecera.titular.nombreRazon }}</sum1:NombreRazon>
					{{#if cabecera.titular.nifRepresentante}}
					<!--Optional:-->
					<sum1:NIFRepresentante>{{ cabecera.titular.nifRepresentante }}</sum1:NIFRepresentante>
					{{/if}}
					<sum1:NIF>{{ cabecera.titular.nif }}</sum1:NIF>
				</sum1:Titular>
				<sum1:TipoComunicacion>{{ cabecera.tipoCom }}</sum1:TipoComunicacion>
			</sum1:Cabecera>
			{{#each registroLRFacturasRecibidas}}
			<!--1 to 10000 repetitions:-->
			<sum:RegistroLRFacturasRecibidas>
				<sum1:PeriodoImpositivo>
					<sum1:Ejercicio>{{ this.periodoImpositivo.ejercicio }}</sum1:Ejercicio>
					<sum1:Periodo>{{ this.periodoImpositivo.periodo }}</sum1:Periodo>
				</sum1:PeriodoImpositivo>
				<sum:IDFactura>
					<sum1:IDEmisorFactura>
						<!--You have a CHOICE of the next 2 items at this level-->
						{{#if this.idFactura.idEmisorFactura.nif}}
						<sum1:NIF>{{ this.idFactura.idEmisorFactura.nif }}</sum1:NIF>
						{{/if}}{{#ifNot this.idFactura.idEmisorFactura.nif}}
						<sum1:IDOtro>
							{{#if this.idFactura.idEmisorFactura.idOtro.codigoPais}}
							<!--Optional:-->
							<sum1:CodigoPais>{{ this.idFactura.idEmisorFactura.idOtro.codigoPais }}</sum1:CodigoPais>
							{{/if}}
							<sum1:IDType>{{ this.idFactura.idEmisorFactura.idOtro.idType }}</sum1:IDType>
							<sum1:ID>{{ this.idFactura.idEmisorFactura.idOtro.id }}</sum1:ID>
						</sum1:IDOtro>
						{{/ifNot}}
					</sum1:IDEmisorFactura>
					<sum1:NumSerieFacturaEmisor>{{ this.idFactura.numSerieFacturaEmisor }}</sum1:NumSerieFacturaEmisor>
					{{#if this.idFactura.numSerieResumen}}
					<!--Optional:-->
					<sum1:NumSerieFacturaEmisorResumenFin>{{ this.idFactura.numSerieResumen }}</sum1:NumSerieFacturaEmisorResumenFin>
					{{/if}}
					<sum1:FechaExpedicionFacturaEmisor>{{ this.idFactura.fechaExpedicionFacturaEmisor }}</sum1:FechaExpedicionFacturaEmisor>
				</sum:IDFactura>
				<sum:FacturaRecibida>
					<sum1:TipoFactura>{{ this.facturaRecibida.tipoFactura }}</sum1:TipoFactura>
					{{#if this.facturaRecibida.tipoRectificativa}}
					<!--Optional:-->
					<sum1:TipoRectificativa>{{ this.facturaRecibida.tipoRectificativa }}</sum1:TipoRectificativa>
					{{/if}}{{#if this.facturaRecibida.facturasAgrupadas}}
					<!--Optional:-->
					<sum1:FacturasAgrupadas>
						{{#each this.facturaRecibida.facturasAgrupadas}}
						<!--1 or more repetitions:-->
						<sum1:IDFacturaAgrupada>
							<sum1:NumSerieFacturaEmisor>{{ this.idFacturaAgrupada.numSerieFacturaEmisor }}</sum1:NumSerieFacturaEmisor>
							<sum1:FechaExpedicionFacturaEmisor>{{ this.idFacturaAgrupada.fechaExpedicionFacturaEmisor }}</sum1:FechaExpedicionFacturaEmisor>
						</sum1:IDFacturaAgrupada>
						{{/each}}
					</sum1:FacturasAgrupadas>
					{{/if}}{{#if this.facturaRecibida.facturasRectificadas}}
					<!--Optional:-->
					<sum1:FacturasRectificadas>
						{{#each this.facturaRecibida.facturasRectificadas}}
						<!--1 or more repetitions:-->
						<sum1:IDFacturaRectificada>
							<sum1:NumSerieFacturaEmisor>{{ this.idFacturaRectificada.numSerieFacturaEmisor }}</sum1:NumSerieFacturaEmisor>
							<sum1:FechaExpedicionFacturaEmisor>{{ this.idFacturaRectificada.fechaExpedicionFacturaEmisor }}</sum1:FechaExpedicionFacturaEmisor>
						</sum1:IDFacturaRectificada>
						{{/each}}
					</sum1:FacturasRectificadas>
					{{/if}}{{#if this.facturaRecibida.importeRectificacion}}
					<!--Optional:-->
					<sum1:ImporteRectificacion>
						<sum1:BaseRectificada>{{ this.idFacturaRectificada.importeRectificacion.baseRectificada }}</sum1:BaseRectificada>
						<sum1:CuotaRectificada>{{ this.idFacturaRectificada.importeRectificacion.cuotaRectificada }}</sum1:CuotaRectificada>
						{{#if this.idFacturaRectificada.importeRectificacion.cuotaRecargoRectificado}}
						<!--Optional:-->
						<sum1:CuotaRecargoRectificado>{{ this.idFacturaRectificada.importeRectificacion.cuotaRecargoRectificado }}</sum1:CuotaRecargoRectificado>
						{{/if}}
					</sum1:ImporteRectificacion>
					{{/if}}{{#if this.facturaRecibida.fechaOperacion}}
					<!--Optional:-->
					<sum1:FechaOperacion>{{ this.facturaRecibida.fechaOperacion }}</sum1:FechaOperacion>
					{{/if}}
					<sum1:ClaveRegimenEspecialOTrascendencia>{{ this.facturaRecibida.claveRegimenEspecialOTrascendencia }}</sum1:ClaveRegimenEspecialOTrascendencia>
					{{#if this.facturaRecibida.claveRegimenEspecialOTrascendenciaAdicional1}}
					<!--Optional:-->
					<sum1:ClaveRegimenEspecialOTrascendenciaAdicional1>{{ this.facturaRecibida.claveRegimenEspecialOTrascendenciaAdicional1 }}</sum1:ClaveRegimenEspecialOTrascendenciaAdicional1>
					{{/if}}{{#if this.facturaRecibida.claveRegimenEspecialOTrascendenciaAdicional2}}
					<!--Optional:-->
					<sum1:ClaveRegimenEspecialOTrascendenciaAdicional2>{{ this.facturaRecibida.claveRegimenEspecialOTrascendenciaAdicional2 }}</sum1:ClaveRegimenEspecialOTrascendenciaAdicional2>
					{{/if}}{{#if this.facturaRecibida.numRegistroAcuerdoFacturacion}}
					<!--Optional:-->
					<sum1:NumRegistroAcuerdoFacturacion>{{ this.facturaRecibida.numRegistroAcuerdoFacturacion }}</sum1:NumRegistroAcuerdoFacturacion>
					{{/if}}{{#if this.facturaRecibida.total}}
					<!--Optional:-->
					<sum1:ImporteTotal>{{ this.facturaRecibida.importeTotal }}</sum1:ImporteTotal>
					{{/if}}{{#if this.facturaRecibida.baseImponibleACoste}}
					<!--Optional:-->
					<sum1:BaseImponibleACoste>{{ this.facturaRecibida.baseImponibleACoste }}</sum1:BaseImponibleACoste>
					{{/if}}
					<sum1:DescripcionOperacion>{{ this.facturaRecibida.descripcionOperacion }}</sum1:DescripcionOperacion>
					<sum1:DesgloseFactura>
						{{#if this.facturaRecibida.desgloseFactura.inversionSujetoPasivo}}
						<!--Optional:-->
						<sum1:InversionSujetoPasivo>
							{{#each this.facturaRecibida.desgloseFactura.inversionSujetoPasivo}}
							<!--1 to 6 repetitions:-->
							<sum1:DetalleIVA>
								<sum1:TipoImpositivo>{{ this.detalleIVA.tipoImpositivo }}</sum1:TipoImpositivo>
								<sum1:BaseImponible>{{ this.detalleIVA.baseImponible }}</sum1:BaseImponible>
								<sum1:CuotaSoportada>{{ this.detalleIVA.cuotaSoportada }}</sum1:CuotaSoportada>
								{{#if this.detalleIVA.tipoRecargoEquivalencia}}
								<!--Optional:-->
								<sum1:TipoRecargoEquivalencia>{{ this.detalleIVA.tipoRecargoEquivalencia }}</sum1:TipoRecargoEquivalencia>
								{{/if}}{{#if this.detalleIVA.cuotaRecargo}}
								<!--Optional:-->
								<sum1:CuotaRecargoEquivalencia>{{ this.detalleIVA.cuotaRecargoEquivalencia }}</sum1:CuotaRecargoEquivalencia>
								{{/if}}
							</sum1:DetalleIVA>
							{{/each}}
						</sum1:InversionSujetoPasivo>
						{{/if}}{{#if this.facturaRecibida.desgloseFactura.desgloseIVA}}
						<!--Optional:-->
						<sum1:DesgloseIVA>
							{{#each this.facturaRecibida.desgloseFactura.desgloseIVA}}
							<!--1 to 6 repetitions:-->
							<sum1:DetalleIVA>
								{{#if this.detalleIVA.tipoImpositivo}}
								<!--Optional:-->
								<sum1:TipoImpositivo>{{ this.detalleIVA.tipoImpositivo }}</sum1:TipoImpositivo>
								{{/if}}
								<sum1:BaseImponible>{{ this.detalleIVA.baseImponible }}</sum1:BaseImponible>
								{{#if this.detalleIVA.cuotaSoportada}}
								<!--Optional:-->
								<sum1:CuotaSoportada>{{ this.detalleIVA.cuotaSoportada }}</sum1:CuotaSoportada>
								{{/if}}{{#if this.detalleIVA.tipoRecargoEquivalencia}}
								<!--Optional:-->
								<sum1:TipoRecargoEquivalencia>{{ this.detalleIVA.tipoRecargoEquivalencia }}</sum1:TipoRecargoEquivalencia>
								{{/if}}{{#if this.detalleIVA.cuotaRecargoEquivalencia}}
								<!--Optional:-->
								<sum1:CuotaRecargoEquivalencia>{{ this.detalleIVA.cuotaRecargoEquivalencia }}</sum1:CuotaRecargoEquivalencia>
								{{/if}}{{#if this.detalleIVA.porcentCompensacionREAGYP }}
								<!--Optional:-->
								<sum1:PorcentCompensacionREAGYP>{{ this.detalleIVA.porcentCompensacionREAGYP }}</sum1:PorcentCompensacionREAGYP>
								{{/if}}{{#if this.detalleIVA.importeCompensacionREAGYP}}
								<!--Optional:-->
								<sum1:ImporteCompensacionREAGYP>{{ this.detalleIVA.importeCompensacionREAGYP }}</sum1:ImporteCompensacionREAGYP>
								{{/if}}
							</sum1:DetalleIVA>
							{{/each}}
						</sum1:DesgloseIVA>
						{{/if}}
					</sum1:DesgloseFactura>
					<sum1:Contraparte>
						<sum1:NombreRazon>{{ this.facturaRecibida.contraparte.nombreRazon }}</sum1:NombreRazon>
						{{#if this.facturaRecibida.contraparte.nifRepresentante}}
						<!--Optional:-->
						<sum1:NIFRepresentante>{{ this.facturaRecibida.contraparte.nifRepresentante }}</sum1:NIFRepresentante>
						{{/if}}
						<!--You have a CHOICE of the next 2 items at this level-->
						{{#if this.facturaRecibida.contraparte.nif}}
						<sum1:NIF>{{ this.facturaRecibida.contraparte.nif }}</sum1:NIF>
						{{/if}}{{#ifNot this.facturaRecibida.contraparte.nif}}
						<sum1:IDOtro>
							{{#if this.facturaRecibida.contraparte.idOtro.codigoPais}}
							<!--Optional:-->
							<sum1:CodigoPais>{{ this.facturaRecibida.contraparte.idOtro.codigoPais }}</sum1:CodigoPais>
							{{/if}}
							<sum1:IDType>{{ this.facturaRecibida.contraparte.idOtro.idType }}</sum1:IDType>
							<sum1:ID>{{ this.facturaRecibida.contraparte.idOtro.id }}</sum1:ID>
						</sum1:IDOtro>
						{{/ifNot}}
					</sum1:Contraparte>
					<sum1:FechaRegContable>{{ this.facturaRecibida.fechaRegContable }}</sum1:FechaRegContable>
					<sum1:CuotaDeducible>{{ this.facturaRecibida.cuotaDeducible }}</sum1:CuotaDeducible>
				</sum:FacturaRecibida>
			</sum:RegistroLRFacturasRecibidas>
			{{/each}}
		</sum:SuministroLRFacturasRecibidas>
	</soapenv:Body>
</soapenv:Envelope>